<template lang="pug">
  .about
    :markdown-it(linkify)
      *Описание будет дополняться*

      *Нужно добавить сюда конкретных примеров, подробнее описать интерфейс*

      **Quantuum Draughts** - вариация шашек с элементами квантовой механики, вдохновлённая игрой [квантовые шахматы](https://ru.wikipedia.org/wiki/%D0%9A%D0%B2%D0%B0%D0%BD%D1%82%D0%BE%D0%B2%D1%8B%D0%B5_%D1%88%D0%B0%D1%85%D0%BC%D0%B0%D1%82%D1%8B).
      В отличие от обычной игры шашки здесь не имеют чёткой позиции на доске, а имеют лишь вероятность нахождения в той или иной клетке

      Каждый ход перемещает выбранную шашку не на одну выбранную клетку, а на несколько клеток сразу, в результате чего шашка переходит в состояние [суперпозиции](https://ru.wikipedia.org/wiki/%D0%9A%D0%B2%D0%B0%D0%BD%D1%82%D0%BE%D0%B2%D0%B0%D1%8F_%D1%81%D1%83%D0%BF%D0%B5%D1%80%D0%BF%D0%BE%D0%B7%D0%B8%D1%86%D0%B8%D1%8F), в котором существует некоторая вероятность обнаружить шашку на одной из этих клеток. Но до того, как произведено прямое
      [наблюдение](https://ru.wikipedia.org/wiki/%D0%98%D0%B7%D0%BC%D0%B5%D1%80%D0%B5%D0%BD%D0%B8%D0%B5_(%D0%BA%D0%B2%D0%B0%D0%BD%D1%82%D0%BE%D0%B2%D0%B0%D1%8F_%D0%BC%D0%B5%D1%85%D0%B0%D0%BD%D0%B8%D0%BA%D0%B0)),
      шашка находится на всех этих клетках одновременно.
      Как известно из квантовой механике, наблюдение невозможно без взаимодействия с объектом, таким образом наблюдение за шашкой производится попыткой ей походить, что приводит к
      [коллапсу суперпозиции](https://ru.wikipedia.org/wiki/%D0%A0%D0%B5%D0%B4%D1%83%D0%BA%D1%86%D0%B8%D1%8F_%D1%84%D0%BE%D0%BD_%D0%9D%D0%B5%D0%B9%D0%BC%D0%B0%D0%BD%D0%B0). То есть в тот момент, когда вы попытаетесь походить шашкой, она окончательно решит, на какой клетке она находится, и может оказаться, что клетка, с которой вы пытались походить, пуста.

      Так же возможна ситуация, когда шашка побила другую шашку с некоторой вероятностью. Тогда побитая шашка находится в состоянии "жива и мертва одновременно", как в мысленном эксперименте про [кота Шрёдингера](https://ru.wikipedia.org/wiki/%D0%9A%D0%BE%D1%82_%D0%A8%D1%80%D1%91%D0%B4%D0%B8%D0%BD%D0%B3%D0%B5%D1%80%D0%B0).
      Вместе с этим частично побитая шашка переходит в состояние [квантовой запутанности](https://ru.wikipedia.org/wiki/%D0%9A%D0%B2%D0%B0%D0%BD%D1%82%D0%BE%D0%B2%D0%B0%D1%8F_%D0%B7%D0%B0%D0%BF%D1%83%D1%82%D0%B0%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D1%8C) с шашкой, побившей её. Это означает, что состояние побитой шашки теперь связано с состоянием побившей шашки, и при изменении состояния одной происходит *мгновенное* изменение состояния другой (кошмарное дальнодействие, как выразился Альберт Эйнштейн). На самом деле теперь нельзя рассматривать состояние этих двух шашек по отдельности, они должны рассматриваться как единая система, описываемая общей [волновой функцией](https://ru.wikipedia.org/wiki/%D0%92%D0%BE%D0%BB%D0%BD%D0%BE%D0%B2%D0%B0%D1%8F_%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F). В интерфейсе игры состояние запутанных шашек показывается полоской по краю шашки, когда выбрана одна из остальных шашек. Если полоска отсутствует - значит состояния шашек никак не связаны. Если полоска полностью заполнена (светлая) - это значит, что обнаружить на этом месте шашку можно тогда и только тогда, когда выбранная шашка находится на своём месте. Если полоска не заполнена (тёмная), это значит, что невозможно обнаружить обе эти шашки стоящими на указанных местах одновременно (либо одна, либо другая).

</template>

<script>
export default {
}
</script>
